{
  "announcements": [
    {
      "title": "Marriage Night",
      "internalUrl": "/enjoy/marriage-night-2019",
      "description": "Healthy marriages don't happen by accident! Flatland will be hosting \"Marriage Night\" presented by RightNow Media Productions, Friday, May 17, 7:00-10:00pm. This evening will include teaching, comedy, and dessert. The cost is $30 per couple. Tap to register. Leave the kids at home and join the fun!",
      "id": "496d6714-4cba-4586-b857-5f25d181ced6"
    },
    {
      "title": "Bring Your Garage Sale Items",
      "description": "You probably have too much \"stuff\". Consider donating it to a good cause. Flatland 144 will host a garage sale Saturday, April 27, 7:00am-3:00pm. Items may be dropped off at Flatland 144 April 24-25, 6:00-8:00pm. There will be volunteers available to help unload larger items. All proceeds from the garage sale help assist those going on Flatland missions trips.",
      "id": "7058a575-44b7-46a5-8d89-d685c56d27ba"
    },
    {
      "title": "Table Talk Groups",
      "description": "Flatland will not have our regular Life Groups during our next series, May 19 - June 23. Instead consider joining a Table Talk Group. Groups consist of 6-10 people that get together for dinner, dessert, or coffee. Tap to register.",
      "id": "313a5aff-fc28-4c7c-8454-ea2d78311e5f",
      "internalUrl": "/move/groups"
    },
    {
      "title": "Graduate Recognition",
      "description": "Flatland will be recognizing graduating high school students Sunday, May 12 during our 9:30am service. If you are graduating or are a parent of a graduate, email jen@flatlandchurch.com",
      "id": "04b9c8ca-d052-47a8-9c10-55d03a9d8514"
    },
    {
      "title": "Baby Dedication Service",
      "description": "May 12 during our 11:00am service Flatland will host a baby dedication service. If you have recently had a baby or would like to have your children dedicated, tap to register. We'll follow up with more information.",
      "internalUrl": "/baby-dedication",
      "id": "d3836e0e-2e2f-4871-8444-8ad6e217a3cb"
    },
    {
      "title": "Summer Camps",
      "description": "High School Camp: June 3-7\nMiddle School Camp: June 10-14\nKids Camp 1 (4th-6th grade): June 17-21\nKids Camp 2 (2nd-4th grade): June 24-27.\nTap to register.",
      "internalUrl": "/enjoy",
      "id": "9f4ca0bc-4d66-4459-89a3-7cc945133489"
    }
  ],
  "message": {
    "title": "The Veil and the Stone",
    "content": [
      "### Observation: What do I see?",
      "**John 20:1-9**\n\n> Early on Sunday morning, while it was still dark, Mary Magdalene came to the tomb and found that the stone had been rolled away from the entrance. She ran and found Simon Peter and the other disciple, the one whom Jesus loved. She said, “They have taken the Lord’s body out of the tomb, and we don’t know where they have put him!”\nPeter and the other disciple started out for the tomb. They were both running, but the other disciple outran Peter and reached the tomb first. He stooped and looked in and saw the linen wrappings lying there, but he didn’t go in. Then Simon Peter arrived and went inside. He also noticed the linen wrappings lying there, while the cloth that had covered Jesus’ head was folded up and lying apart from the other wrappings. Then the disciple who had reached the tomb first also went in, and he saw and believed –— for until then they still hadn’t understood the Scriptures that said Jesus must rise from the dead. (NLT)",
      "**John 20:11-18**\n\n> Mary was standing outside the tomb crying, and as she wept, she stooped and looked in. She saw two white-robed angels, one sitting at the head and the other at the foot of the place where the body of Jesus had been lying. (NLT)",
      "**Matthew 27:50-51**\n\n> Jesus cried out again with a loud voice, and yielded up His spirit. And behold, the veil of the temple was torn in two from top to bottom; and the earth shook and the rocks were split. (NASB)",
      "#### The veil and the stone are connected",
      "![tomb](https://firebasestorage.googleapis.com/v0/b/flatland-api.appspot.com/o/2%20Tomb.JPG?alt=media&token=4bfd86a6-cc43-490c-a2c0-3da081448141)",
      "![temple blueprint](https://firebasestorage.googleapis.com/v0/b/flatland-api.appspot.com/o/3%20Blueprint.jpg?alt=media&token=1473e562-1319-49e1-bde2-d2e15fb21138)",
      "### Interpretation: What does it mean?",
      "![ark of the covenant](https://firebasestorage.googleapis.com/v0/b/flatland-api.appspot.com/o/1%20Ark%20of%20the%20Covenant.png?alt=media&token=9a518a8d-51d3-4c05-923e-90c190b55312)",
      "#### A new way into God’s presence has been opened",
      "**Hebrews 10:19-20**\n\n> And so, dear brothers and sisters, we can boldly enter heaven’s Most Holy Place because of the blood of Jesus. By his death, Jesus opened a new and life-giving way through the curtain into the Most Holy Place. (NLT)",
      "**Romans 4:25**\n\n> He was handed over to die because of our sins, and he was raised to life to make us right with God. (NLT)",
      "### Application: What does this mean to me?",
      "#### We come into the Most Holy Place through faith",
      "**Hebrews 4:16**\n\n> “So let us come boldly to the throne of our gracious God. There we will receive his mercy, and we will find grace to help us when we need it most.” (NLT)",
      "**Romans 10:9**\n\n> If you openly declare that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved. (NLT)"
    ]
  },
  "challenge": {
    "content": ""
  }
}